6_semester/КИСП/Курсовая/src/Documents/ЗаявкаНаБронь.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>ЗаявкаНаБронь</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Клиенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Компьютер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Компьютеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тариф</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Тарифы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоСеанса</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОкончаниеСеанса</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

6_semester/КИСП/Курсовая/src/Documents/ЗаявкаНаБронь/Ext/ObjectModule.bsl
&НаСервере
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	// Проверка на пересечение времени бронирования для выбранного компьютера
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаявкаНаБронь.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ЗаявкаНаБронь КАК ЗаявкаНаБронь
		|ГДЕ
		|	ЗаявкаНаБронь.Проведен = ИСТИНА
		|	И ЗаявкаНаБронь.Компьютер = &Компьютер
		|	И ЗаявкаНаБронь.Ссылка <> &ТекущийДокумент
		|	И ЗаявкаНаБронь.НачалоСеанса < &ОкончаниеСеанса
		|	И ЗаявкаНаБронь.ОкончаниеСеанса > &НачалоСеанса";
	
	Запрос.УстановитьПараметр("Компьютер", Компьютер);
	Запрос.УстановитьПараметр("НачалоСеанса", НачалоСеанса);
	Запрос.УстановитьПараметр("ОкончаниеСеанса", ОкончаниеСеанса);
	Запрос.УстановитьПараметр("ТекущийДокумент", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		Отказ = Истина;
		Сообщить("Выбранный компьютер (" + Строка(Компьютер) + ") уже забронирован на указанное время!");
	КонецЕсли;

КонецПроцедуры
